Ajax_Notes_Rails/app/controllers/notes_controller.rb

  def create
  	#@render :text => params[:title]
  	add_note = Note.new(:title => params[:title])
  	add_note.save
---
INSERT INTO "notes" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 18 Mar 2014 07:25:10 UTC +00:00], ["title", "sdas"], ["updated_at", Tue, 18 Mar 2014 07:25:10 UTC +00:00]]

  def update
    #render :text => params
    note = Note.find params[:id]
    note.description = params[:description]
    note.save
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "80"]]
UPDATE "notes" SET "description" = ?, "updated_at" = ? WHERE "notes"."id" = 80  [["description", "me"], ["updated_at", Wed, 19 Mar 2014 01:29:48 UTC +00:00]]

  def destroy
    delete_note = Note.find params[:id]
    delete_note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "77"]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 77]]