The_Wall_Redux/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "hello"], ["created_at", Fri, 04 Apr 2014 14:34:03 UTC +00:00], ["post_id", 16], ["updated_at", Fri, 04 Apr 2014 14:34:03 UTC +00:00], ["user_id", 4]]
---
  def create
    c = Comment.new(comment_params)
    if c.save == false

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "undefined"]]
---
  def destroy
    c = Comment.find(params[:id])