The_Wall_Redux/app/controllers/posts_controller.rb

	def create
		p = Post.new(post_params)
		if p.save == false
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id", "wall_id") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["created_at", Fri, 04 Apr 2014 14:33:54 UTC +00:00], ["updated_at", Fri, 04 Apr 2014 14:33:54 UTC +00:00], ["user_id", 4], ["wall_id", 4]]