The_Wall_Redux/app/controllers/users_controller.rb

SELECT id, name, email, created_at FROM "users"
---
  def index
    if signed_in?
      @users = User.all.select(:id, :name, :email, :created_at)

INSERT INTO "users" ("created_at", "email", "encrypted_password", "first_name", "last_name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."wall_id" = 4
---
  def show
    if signed_in?
      @user = User.find(params[:id])
      @author_id = session[:user_id];

      @post = Post.new
      @comment = Comment.new

      @posts = Post.where(wall_id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
  def destroy
    u = User.find(params[:id])

    if current_user?(u)
        flash[:notice] = "You really shouldn't delete yourself - it isn't healthy!"
    elsif u.destroy == false