The_Wall_Redux/app/views/users/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 16]]
---
		<div class='indent-comments'>
<% 			if post.comments.length > 0